yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
#include "app_task.h"
#include "debug.h"
#include "string.h"
#include "Middle_ring_buffer.h"
#include "ch32v30x_iwdg.h"

/* 控制本文件的调试打印：0=关闭，1=开启 */
#ifndef APP_DEBUG_PRINT
#define APP_DEBUG_PRINT 0
#endif

#if APP_DEBUG_PRINT
#define APP_LOG(...)    printf(__VA_ARGS__)
#else
#define APP_LOG(...)    ((void)0)
#endif

// 传感器相关的 handler 和 port
#include "sht40_handler.h"
#include "../bsp/sht40/sht40_port.h"
#include "../bsp/bsp_MLX_90614/bsp_MLX_90614_handler.h"
#include "../bsp/bsp_MLX_90614/bsp_MLX_90614_port.h"
#include "../bsp/bsp_max_30102/bsp_max_30102_handler.h"
#include "../bsp/bsp_max_30102/bsp_max_30102_port.h"
#include "../bsp/bsp_max_30102/bsp_max_30102_reg.h"
#include "../bsp/bsp_a7670c/bsp_a7670c.h"
#include "../bsp/usart_wifi_esp/usart_wifi_esp.h"
#include "../bsp_rtc/bsp_rtc.h"
#include "../bsp/bsp_tianwen/bsp_tianwen_reg.h"
#include "../bsp/bsp_rtc/bsp_rtc.h"      // 解决 BSP_RTC_Init 报错

#include "debug.h"
#include "system.h"
#include "lcd.h"      // 添加 LCD 头文件
#include "touch.h"
#include "ctpiic.h"
#include <stdio.h>
#include <string.h>
#include "lvgl.h"
#include "lv_port_disp.h"
#include "lv_port_indev.h"
#include "lv_port_indev.h"
#include "information.h"
#include "gui_guider.h"
#include "events_init.h"
/* 触摸屏扫描（FT6336 软件 I2C） */
#include "touch.h"


//////////////////////////
RingBuffer_t g_ring_buffer = {0};
QueueHandle_t xUART_Queue = NULL;
SemaphoreHandle_t xDMA_Sem = 0;
SemaphoreHandle_t xBufferDataSemaphore = NULL;
QueueHandle_t xSysCmdQueue = NULL; // 系统命令队列
QueueHandle_t CmdQueue = NULL; // 系统命令队列
QueueHandle_t sendtianwenQueue = NULL; // 天问通信命令队列
QueueHandle_t sensor_data_lcd_queue = NULL; // 传感器数据队列
SemaphoreHandle_t xGuiMutex = NULL; // LVGL 互斥锁，防止多任务并发访问 GUI
SemaphoreHandle_t xSem_face_recog;// 人脸识别检测开始同步信号量
SemaphoreHandle_t xSem_face_result_yes; // 人脸识别结果信号量(识别成功)
SemaphoreHandle_t xSem_face_result_no; // 人脸识别结果信号量(识别失败)
SemaphoreHandle_t xSem_face_add; // 人脸添加开始同步信号量
SemaphoreHandle_t xSem_face_add_result; // 人脸添加结果同步信号量
SemaphoreHandle_t xSem_Btn_Eat; // 吃药按钮按下同步信号量
/* 任务句柄 */
TaskHandle_t bspSensorTask_Handler;
TaskHandle_t appTask_Handler;
TaskHandle_t usartTask_Handler;
TaskHandle_t watchdogTask_Handler;
TaskHandle_t tianwenTask_Handler;
TaskHandle_t lcdTask_Handler; // 如果有 LCD 任务的话


 extern volatile uint8_t a7670c_ready; // 在A7670C初始化完成后置1
 extern SystemCommand_t received_cmd;
 extern AlarmSche my_meds[3]; // 从 bsp_rtc.h 中 extern 引入吃药时间表
 UI_DisplayData_t g_ui_data; // 全局 UI 数据结构实例

void check_medication_time(void); // 声明检查吃药时间的函数

void app_task(void *pvParameters)
{
//主函数。逻辑函数，根据系统指令执行相应的操作
    (void)pvParameters;
    APP_LOG("\n[App] Smart Medicine Box Started\n");
    // 初始化漏服记录

    //发送开机语音播报命令到天问模块
    Tianwen_Packet_t tianwen_packet;
    tianwen_packet.id = CMD_TX_BOOT_VOICE; // 定义一个新的指令，比如 CMD_TX_BOOT_VOICE
    tianwen_packet.data_len = 0; // 没有额外数据(命令帧)
    xQueueSend(sendtianwenQueue, &tianwen_packet, portMAX_DELAY); // 确保开机播报命令一定能发送出去

    //设置时间：
    BSP_RTC_ModifyTime(2026, 5, 20, 23, 59, 50); // 设置初始时间为2026年3月2日23:59:00
    //设置闹钟(已经设置就生效，所以放在主循环前面)
    ///BSP_RTC_UpdateNextAlarm(); // 根据 my_meds 数组设置第一个闹钟

    //定义一个变量来跟踪当前检查的吃药时间索引
   AppMsg_t msg;

    for (;;)
    {
       
        BaseType_t ret = xQueueReceive(xAppEventQueue, &msg, pdMS_TO_TICKS(10));

        if (ret == pdPASS) 
        {
            // 收到具体事件，开始处理分支
            switch (msg.event_id) 
            {
                case MSG_FACE_RECOG_START:// 人脸识别开始事件
                    APP_LOG("[App] Event: Face recognition started\n");
                    // 模拟：给系统自己发一个成功事件（实战中这应该由串口中断发）
                    AppMsg_t sim_msg = { .event_id = MSG_FACE_RECOG_SUCCESS };
                    xQueueSend(xAppEventQueue, &sim_msg, 0);
                    break;

                case MSG_FACE_RECOG_SUCCESS:// 人脸识别成功事件
                    APP_LOG("[App] Event: Face recognition Success\n");
                    tianwen_packet.id = CMD_TX_REGISTERED_USER; 
                    xQueueSend(sendtianwenQueue, &tianwen_packet, 0); 
                    break;

                case MSG_FACE_RECOG_FAIL:// 人脸识别失败事件
                    APP_LOG("[App] Event: Face recognition Fail\n");
                    tianwen_packet.id = CMD_TX_UNREGISTERED; 
                    xQueueSend(sendtianwenQueue, &tianwen_packet, 0); 
                    break;

                case MSG_BTN_EAT_PRESSED:// 吃药按钮按下事件
                    APP_LOG("[App] Event: User pressed EAT button\n");
                    // 用户按键后，主动触发一次时间检查
                    msg.event_id = MSG_CHECK_MED_TIME;
                    xQueueSend(xAppEventQueue, &msg, 0);
                    break;

                case MSG_CHECK_MED_TIME:// 检查吃药时间事件（定时触发或者按键触发）
                    APP_LOG("[App] Event: Checking Medication Time\n");
                    check_medication_time(); // 调用下面封装的函数
                    break;

                // ... 处理其他事件 ...
                default:
                    break;
            }
        }
        
        /* 喂狗：通知 watchdog_task */
        if (watchdogTask_Handler != NULL) {
            xTaskNotifyGive(watchdogTask_Handler);
        }


    
        vTaskDelay(pdMS_TO_TICKS(20)); // 每20ms检查一次事件队列和喂一次狗
    }
}


void lcd_task(void *pvParameters)
{
    
    for(;;) {

        if(xSemaphoreTake(xGuiMutex, portMAX_DELAY) == pdTRUE) {
            lv_tick_inc(10);      // 先递增 LVGL tick
            lv_timer_handler();  // 处理 LVGL 定时器
            xSemaphoreGive(xGuiMutex);
        }
        
        vTaskDelay(pdMS_TO_TICKS(5)); // 每20ms更新一次 LCD
    }
}

void sensor_lcd_task(void *pvParameters)
{
    static Tianwen_Packet_t sensor_lcd_packet;
    uint32_t last_rtc_update_tick = 0;
    uint32_t current_tick = 0;
    static uint32_t last_miss_check_tick = 0;  // 漏服检查计时
     (void)pvParameters;

    // 开机初始化：从 Flash 恢复之前保存的历史记录和配置数据
    SystemData_Init_Load();

    // 将从 Flash 加载的 meds_schedule 同步到 my_meds
    memcpy(my_meds, g_ui_data.meds_schedule, sizeof(my_meds));

    for(;;)
    {
        // 1. 触摸屏扫描
        FT6336_Scan();

        // 每10秒检查一次是否漏服
        current_tick = xTaskGetTickCount();
        if ((current_tick - last_miss_check_tick) >= pdMS_TO_TICKS(10000)) {
            check_missed_doses();
            last_miss_check_tick = current_tick;
        }
       
        // ==========================================
        // 第一部分：数据接收，追加进入历史数组并自动存 Flash
        // ==========================================
        if(xQueueReceive(sensor_data_lcd_queue, &sensor_lcd_packet, pdMS_TO_TICKS(20)) == pdPASS) 
        {
            switch(sensor_lcd_packet.id)
            {
                case SENSOR_ID_HEART_RATE_SPO2: {
                    uint16_t hr = (sensor_lcd_packet.data[0] << 8) | sensor_lcd_packet.data[1];
                    uint16_t spo2 = (sensor_lcd_packet.data[2] << 8) | sensor_lcd_packet.data[3];
                    // 核心修改：追加到历史数组并存 Flash
                    Add_History_HR_SpO2(hr, spo2); 
                    break;
                }
                case SENSOR_ID_MLX_TEMP_BOTH: {
            // 使用小端模式解析 (低位在前)
            uint16_t bt = (uint16_t)(sensor_lcd_packet.data[0] | (sensor_lcd_packet.data[1] << 8));
    
            // 如果原数据有可能是负数（虽然体温通常为正），建议转为 int16_t
            int16_t bt_signed = (int16_t)bt;
            Add_History_BodyTemp(bt_signed);
            break;
}
                case SENSOR_ID_TEMPERATURE_HUMIDITY: {
                    uint16_t et = (sensor_lcd_packet.data[0] << 8) | sensor_lcd_packet.data[1];
                    uint16_t eh = (sensor_lcd_packet.data[2] << 8) | sensor_lcd_packet.data[3];
                    Add_History_EnvTH(et, eh);
                    break;
                }
            }
        }
        

        // 限制 1秒 更新一次全局系统时间
        current_tick = xTaskGetTickCount();
        if ((current_tick - last_rtc_update_tick) >= pdMS_TO_TICKS(1000)) 
        {
            last_rtc_update_tick = current_tick;
            BSP_RTC_GetDateTime(&g_ui_data.time);
            g_ui_data.update_flags |= UI_FLAG_TIME;
        }

