yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
         /*检查是否是新的一天，清除med_status*/
        if(g_ui_data.time.hour == 0 && g_ui_data.time.min == 0 && g_ui_data.time.sec < 5) {
            memset(g_ui_data.med_status, 0, sizeof(g_ui_data.med_status));
        }
        // ==========================================
        // 第二部分：统一执行 LVGL UI 渲染 (显示数组中最新的数据)
        // ==========================================
        static lv_obj_t *last_scr = NULL;
        lv_obj_t *curr_scr = lv_scr_act();
        
        // 如果页面发生了切换，强制刷新所有数据，防止进入新页面后数据显示为空
        if (curr_scr != last_scr) {
            g_ui_data.update_flags = 0xFFFFFFFF;
            last_scr = curr_scr;
        }

        if (g_ui_data.update_flags != 0) 
        {
            if(xSemaphoreTake(xGuiMutex, pdMS_TO_TICKS(100)) == pdTRUE) 
            {
                // 强制同步：确保 my_meds 始终与 g_ui_data (Flash数据) 一致
                extern AlarmSche my_meds[3];
                memcpy(my_meds, g_ui_data.meds_schedule, sizeof(my_meds));

                // 1. 刷新心率血氧 (读取数组最后一个元素)
                if ((g_ui_data.update_flags & UI_FLAG_HR_SPO2) && g_ui_data.hr_count > 0) {
                    uint16_t latest_hr = g_ui_data.hr_history[g_ui_data.hr_count - 1].hr;
                    uint16_t latest_spo2 = g_ui_data.hr_history[g_ui_data.hr_count - 1].spo2;
                    if (lv_obj_is_valid(guider_ui.screen_2_label_13))
                        lv_label_set_text_fmt(guider_ui.screen_2_label_13, "%d b", latest_hr/100); 
                    if (lv_obj_is_valid(guider_ui.screen_2_label_14))
                        lv_label_set_text_fmt(guider_ui.screen_2_label_14, "%d %%", latest_spo2/100); 
                }

                // 2. 刷新体温 
                if ((g_ui_data.update_flags & UI_FLAG_BODY_TEMP) && g_ui_data.bt_count > 0) {
                    uint16_t latest_bt = g_ui_data.bt_history[g_ui_data.bt_count - 1].body_temp;
                    if (lv_obj_is_valid(guider_ui.screen_2_label_15)) 
                        lv_label_set_text_fmt(guider_ui.screen_2_label_15, "%d.%02d°C", latest_bt/100, latest_bt%100);
                }

                // 3. 刷新环境温湿度
                if ((g_ui_data.update_flags & UI_FLAG_ENV_TH) && g_ui_data.env_count > 0) {
                    uint16_t latest_et = g_ui_data.env_history[g_ui_data.env_count - 1].env_temp;
                    uint16_t latest_eh = g_ui_data.env_history[g_ui_data.env_count - 1].env_humi;
                    if (lv_obj_is_valid(guider_ui.screen_label_7))
                        lv_label_set_text_fmt(guider_ui.screen_label_7, "%d.%02d°C", latest_et/100, latest_et%100);
                    if (lv_obj_is_valid(guider_ui.screen_label_8))
                        lv_label_set_text_fmt(guider_ui.screen_label_8, "%d.%02d %%", latest_eh/100, latest_eh%100);
                }

                 /*显示wifi状态*/
                if (lv_obj_is_valid(guider_ui.screen_label_2))
                {
                    lv_label_set_text_fmt(guider_ui.screen_label_2, "%c", g_ui_data.wifi_status);
                }

                // 4. 刷新时间
                if (g_ui_data.update_flags & UI_FLAG_TIME) {
                    if (lv_obj_is_valid(guider_ui.screen_label_4))
                        lv_label_set_text_fmt(guider_ui.screen_label_4, "%02d:%02d:%02d", 
                            g_ui_data.time.hour, g_ui_data.time.min, g_ui_data.time.sec);
                    if (lv_obj_is_valid(guider_ui.screen_label_3))
                        lv_label_set_text_fmt(guider_ui.screen_label_3, "%04d/%02d/%02d",
                             g_ui_data.time.year, g_ui_data.time.month, g_ui_data.time.day);
                }


                // 6. 刷新漏服记录 — index0=最新，显示4行，第一行最新
                if (g_ui_data.update_flags & UI_FLAG_RECORDS) {
                    lv_obj_t* labels[] = {
                        guider_ui.screen_2_label_2, // 第一行 — 最新记录 (index 0)
                        guider_ui.screen_2_label_4, // 第二行 — 次新 (index 1)
                        guider_ui.screen_2_label_5, // 第三行 (index 2)
                        guider_ui.screen_2_label_3  // 第四行 — 最旧 (index 3)
                    };
                    for(int i = 0; i < 4; i++) {
                        if(lv_obj_is_valid(labels[i])) {
                            if(i < g_ui_data.record_count) {
                                lv_label_set_text_fmt(labels[i], "no:%lu time:%s turn:%s",
                                    (unsigned long)g_ui_data.missed_records[i].id,
                                    g_ui_data.missed_records[i].date,
                                    g_ui_data.missed_records[i].time);
                               
                            } else {
                                lv_label_set_text(labels[i], ""); // 无数据则空白
                            }
                        }
                    }
                }
                
                if(g_ui_data.update_flags & UI_FLAG_SCHEDULE) {
                    if(lv_obj_is_valid(guider_ui.screen_4_label_2))
                        lv_label_set_text_fmt(guider_ui.screen_4_label_2, "Time: %02d:%02d", 
                            g_ui_data.meds_schedule[0].hour, g_ui_data.meds_schedule[0].min);
                    
                    if(lv_obj_is_valid(guider_ui.screen_4_label_20))
                        lv_label_set_text_fmt(guider_ui.screen_4_label_20, "Time: %02d:%02d", 
                            g_ui_data.meds_schedule[1].hour, g_ui_data.meds_schedule[1].min);
                    
                    if(lv_obj_is_valid(guider_ui.screen_4_label_23))
                        lv_label_set_text_fmt(guider_ui.screen_4_label_23, "Time: %02d:%02d", 
                            g_ui_data.meds_schedule[2].hour, g_ui_data.meds_schedule[2].min);


                    /* 3. 同步下拉框选中状态 */
                    if(lv_obj_is_valid(guider_ui.screen_4_ddlist_4)) {
                        uint16_t sel = (g_ui_data.meds_schedule[0].pill_count > 0) ? (g_ui_data.meds_schedule[0].pill_count - 1) : 0;
                        lv_dropdown_set_selected(guider_ui.screen_4_ddlist_4, sel);
                    }
                    if(lv_obj_is_valid(guider_ui.screen_4_ddlist_2)) {
                        uint16_t sel = (g_ui_data.meds_schedule[1].pill_count > 0) ? (g_ui_data.meds_schedule[1].pill_count - 1) : 0;
                        lv_dropdown_set_selected(guider_ui.screen_4_ddlist_2, sel);
                    }
                    if(lv_obj_is_valid(guider_ui.screen_4_ddlist_3)) {
                        uint16_t sel = (g_ui_data.meds_schedule[2].pill_count > 0) ? (g_ui_data.meds_schedule[2].pill_count - 1) : 0;
                        lv_dropdown_set_selected(guider_ui.screen_4_ddlist_3, sel);
                    }
                }

                /*检查是否到吃药时间刷新*/
                if(g_ui_data.update_flags & UI_FLAG_MED_STATUS) 
                {
                if(g_ui_data.screen_3_update_step==true)
                {
                // 5. 刷新吃药状态按钮 (控制 Screen 3 上的按键显示)
                if (lv_obj_is_valid(guider_ui.screen_3_btn_med1)) {
                    if (g_ui_data.med_status[0] == 1) { // 已经吃药
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med1_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med1_label, "已服");
                        lv_obj_add_state(guider_ui.screen_3_btn_med1, LV_STATE_DISABLED); // 禁用按钮
                    } else { // 未吃药
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med1_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med1_label, "吃药");
                        lv_obj_clear_state(guider_ui.screen_3_btn_med1, LV_STATE_DISABLED); // 解除禁用
                    }
                }
                
