yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
                if (lv_obj_is_valid(guider_ui.screen_3_btn_med2)) {
                    if (g_ui_data.med_status[1] == 1) {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med2_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med2_label, "已服");
                        lv_obj_add_state(guider_ui.screen_3_btn_med2, LV_STATE_DISABLED);
                    } else {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med2_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med2_label, "吃药");
                        lv_obj_clear_state(guider_ui.screen_3_btn_med2, LV_STATE_DISABLED);
                    }
                }

                if (lv_obj_is_valid(guider_ui.screen_3_btn_med3)) {
                    if (g_ui_data.med_status[2] == 1) {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med3_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med3_label, "已服");
                        lv_obj_add_state(guider_ui.screen_3_btn_med3, LV_STATE_DISABLED);
                    } else {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med3_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med3_label, "吃药");
                        lv_obj_clear_state(guider_ui.screen_3_btn_med3, LV_STATE_DISABLED);
                    }
                }
            }
            else if(g_ui_data.screen_3_update_step==false)
            {
                if (lv_obj_is_valid(guider_ui.screen_3_label_1)){
               lv_label_set_text(guider_ui.screen_3_label_1, "不在用药时间"); 
                }
            }
        }
                 // 刷新完成后，清除更新标志
                g_ui_data.update_flags = 0; 
                xSemaphoreGive(xGuiMutex);
            }
        }
        vTaskDelay(pdMS_TO_TICKS(50));
    }   
}


void bsp_sensor_task(void *pvParameters)
{
    A7670C_Init();
    for(;;)
    {
        // 阻塞等待系统指令（语音触发）
        if (xQueueReceive(xSysCmdQueue, &received_cmd, portMAX_DELAY) == pdPASS)
        {
            switch (received_cmd)
            {
                case CMD_MEASURE_HR_SPO2:
                    APP_LOG("[App] Received CMD: Measure Heart Rate & SpO2\n");
                    if (g_max_handler_instance != NULL) {
                        max_event_t max_evt;
                        max_evt.event_type       = max_event_calc_hr_spo2;
                        max_evt.lifetime         = 500;
                        max_evt.sample_count     = MAX30102_DATA_NUM;
                        max_evt.pf_calc_callback = on_hr_spo2_calculated;
                        max30102_handler_send_event(g_max_handler_instance, &max_evt);
                    }
                    else {
                        printf("[App] MAX30102 Handler not ready!\n");
                    }
                    break;

                case CMD_MEASURE_BODY_TEMP:
                    APP_LOG("[App] Received CMD: Measure Body Temperature\n");
                    if (g_handler_instance != NULL) {
                        th_event_t mlx_evt;
                        mlx_evt.event_type = th_event_body_temp;
                        mlx_evt.lifetime = 500;
                        mlx_evt.pf_callback = MLX90614_Port_OnDataReady;
                        bsp_th_handler_t *h_mlx = (bsp_th_handler_t *)g_handler_instance;
                        h_mlx->os_handler_instance->pf_os_queue_put(h_mlx->event_queue_handler, &mlx_evt, 10);
                    }
                    break;

                case CMD_MEASURE_ENV_TEMP_HUMI:
                    //APP_LOG("[App] Received CMD: Measure Env Temp & Humidity\n");
                    if (g_temp_humi_handler_instance != NULL) {
                        temp_humi_event_t sht_evt;
                        sht_evt.event_type = TEMP_HUMI_EVENT_BOTH;
                        sht_evt.lifetime = 500;
                        sht_evt.pf_callback = on_SHT40_DATA_ready;
                        bsp_temp_humi_handler_t *h_sht = (bsp_temp_humi_handler_t *)g_temp_humi_handler_instance;
                        h_sht->os_interface->os_queue_put(h_sht->event_queue_handle, &sht_evt, 10);
                    }
                    break;

                case CMD_SEND_SMS_ALERT:
                    APP_LOG("[App] Received CMD: Send SMS Alert\n");
                    if (!a7670c_ready) {
                        printf("[App] A7670C not ready, cannot send SMS!\n");
                        break;
                    }
                    A7670C_WakeUp();
                    APP_LOG("--- Alert triggered: Sending SMS ---\r\n");
                    A7670C_SendSMS_Auto("18135183446", "请按时服药！");
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    A7670C_EnterSleep();
                    APP_LOG("--- SMS sent, module sleeping ---\r\n");
                    break;

                default:
                    break;
            }
        }
    }
}

/* -------------------------------------------------------------
 * 3. WIFI 数据上传与指令接收任务
 * ------------------------------------------------------------- */
void usart_task(void *pvParameters)
{
    Packet_t packet;
    Packet_t rx_packet;
    static TickType_t last_sync_tick = 0;  // 记录上次同步时间
    static uint8_t is_first_sync = 1;      // 首次同步标志
    static TickType_t last_wifi_tick = 0;  // 记录上次收到WiFi状态的时间
    (void)pvParameters;
    for (;;)
    {
    

        // 1. 发送逻辑：处理 RingBuffer 中的待发送数据
        while (RingBuffer_isEmpty(&g_ring_buffer) == 0x00)
        {
            if (RingBuffer_pop(&g_ring_buffer, &packet) == 0xAF)
            {
                if (USART_WIFI_ESP_Send(&packet) != USART_WIFI_ESP_OK) {
                    printf("[usart_task] Failed to send packet to ESP8266\n");
                }
            }
            vTaskDelay(pdMS_TO_TICKS(5));
            if (watchdogTask_Handler != NULL) {
                xTaskNotifyGive(watchdogTask_Handler);
            }
        }

        // 2. 接收逻辑：从 WiFi 接收指令包 (包含时间同步指令)
        if (USART_WIFI_ESP_Receive(&rx_packet) == USART_WIFI_ESP_OK)
        {

            /*时间同步*/
            if (rx_packet.sensor_id == CMD_RTC_SYNC && rx_packet.data_len >= 6)
            {
                uint8_t year   = rx_packet.payload[0];
                uint8_t month  = rx_packet.payload[1];
                uint8_t day    = rx_packet.payload[2];
                uint8_t hour   = rx_packet.payload[3];
                uint8_t minute = rx_packet.payload[4];
                uint8_t second = rx_packet.payload[5];

