yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
                TickType_t current_tick = xTaskGetTickCount();
                
                // 每200秒校准一次误差 (首次或者间隔超过200,000ms)
                if (is_first_sync || (current_tick - last_sync_tick) >= pdMS_TO_TICKS(20000))
                {
                    // printf("\r\n[Time Sync] Calibrating RTC (Interval 200s): 20%02d-%02d-%02d %02d:%02d:%02d\n", 
                    //         year, month, day, hour, minute, second);
                    
                    // 修改 RTC 时间
                    BSP_RTC_ModifyTime(2000 + year, month, day, hour, minute, second);
                    
                    last_sync_tick = current_tick;
                    is_first_sync = 0;

                    // 立即更新 LCD 显示的时间
                    BSP_RTC_GetDateTime(&g_ui_data.time);
                    g_ui_data.update_flags |= UI_FLAG_TIME;
                    
                    printf("[Time Sync] RTC & LCD display calibrated successfully!\n");
                }
            }

            /*位置同步*/
            if (rx_packet.sensor_id == CMD_LOCATION_SYNC && rx_packet.data_len >= 8)
            {
                char city_name[16]={0};
                memcpy(city_name, rx_packet.payload, rx_packet.data_len);
                APP_LOG("\r\n[Location Sync] Received new location: %s\n", city_name);
                /*保存在w25qxx中*/
                //W25Q_WriteData(LOCATION_STORAGE_ADDR, (uint8_t*)city_name, 16);
            }

            /*天气同步*/
            if (rx_packet.sensor_id == CMD_WEATHER_SYNC && rx_packet.data_len >= 2)
            {
                int8_t weather_code= (int8_t)rx_packet.payload[0]; // 天气代码
                // 心知天气官方代码参考
                    switch(weather_code) {
                            case 0: APP_LOG("weather: clear"); break;
                            case 4: APP_LOG("weather: cloudy"); break; // 4 对应多云
                            case 6: APP_LOG("weather: overcast"); break;
                            case 9: APP_LOG("weather: partly cloudy"); break;
                            case 10: APP_LOG("weather: shower"); break;
                            // ... 更多代码
                            default:  break;
                            }
                int8_t temperature = (int8_t)rx_packet.payload[1]; // 温度
                APP_LOG("\r\n[Weather Sync] Received weather update: Temp=%d°C\n", temperature);
                /*可以根据天气代码更新 LCD 上的天气图标，温度可以显示在天气图标旁边*/
                /*保存在w25qxx中*/
                //W25Q_WriteData(LOCATION_STORAGE_ADDR, (uint8_t*)city_name, 16);
            }

            /*wifi状态更新*/
            if (rx_packet.sensor_id == CMD_WIFI_STATUS_UPDATE)
            {
                
                APP_LOG("[WiFi] Status update received: 0x%02X\n", rx_packet.payload[0]);
                if(rx_packet.payload[0] == 0x32) {
                    // 接收到心跳包，说明模块在线，更新 WiFi 状态和最后收到状态的时间戳
                    last_wifi_tick = xTaskGetTickCount();
                    g_ui_data.wifi_status = 'T'; // 'T' 表示 WiFi 已连接
                } else {
                    g_ui_data.wifi_status = 'F'; // 'F' 表示 WiFi 断开
                }
                g_ui_data.update_flags |= UI_FLAG_WIFI; // 触发 UI 刷新
            }
        }
       // ==========================================
        // 3. 独立的心跳超时检测逻辑 (放在接收 if 块的外面)
        // ==========================================
        /* 串口 20s 内没有接收到任何数据时，把 wifi_status 设置为 'F' */
        if(g_ui_data.wifi_status == 'T') 
        {
            if ((xTaskGetTickCount() - last_wifi_tick) >= pdMS_TO_TICKS(20200)) 
            {
                APP_LOG("[WiFi] No status update received for 20s, setting status to 'F'\n");
                g_ui_data.wifi_status = 'F';
                g_ui_data.update_flags |= UI_FLAG_WIFI; // 触发 UI 刷新
            }
        }

        vTaskDelay(pdMS_TO_TICKS(20));
    }
    }



void vApplicationMallocFailedHook(void)
{
    taskDISABLE_INTERRUPTS();
    APP_LOG("[Error] Malloc Failed\n");
    while (1){}
}

/* 看门狗喂狗任务：定期喂独立看门狗，防止系统卡死 */
void watchdog_task(void *pvParameters)
{
    (void)pvParameters;
    for(;;)
    {
        // 等待 app_task 的喂狗通知，如果在 2000ms 内等不到，说明 app_task 卡死了
        // 注意：不等待通知直接喂狗掩盖了死机，这里我们恢复通知等待机制
        if (ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(2000))) 
        {
            IWDG_ReloadCounter();
        } 
        else 
        {
            // 超时未收到通知，可能是卡死了，不喂狗，让系统复位
            APP_LOG("[Watchdog] Timeout waiting for App Task notification!\r\n");
        }
         //printf("the process is running!\n");
            vTaskDelay(pdMS_TO_TICKS(1000));
    }

}

/*规定时间为前后10分钟*/
void check_medication_time(void) {
    RTC_TimeTypeDef current_time;
    BSP_RTC_GetDateTime(&current_time);
    
    int16_t curr_total_mins = current_time.hour * 60 + current_time.min;
    
    APP_LOG("[Check Med Time] Current time: %02d:%02d\n", current_time.hour, current_time.min);
    
    Tianwen_Packet_t tw_pkt;
    tw_pkt.data_len = 0;
    
    uint8_t is_time_to_eat = 0; // 核心：定义一个标志位，0代表没到时间，1代表到时间了
    
    // 遍历检查设定的3个吃药时间
    for (int i = 0; i < MAX_SCHE; i++) {
        int16_t target_total_mins = my_meds[i].hour * 60 + my_meds[i].min;
        int16_t diff_mins = curr_total_mins - target_total_mins;
        
        // 处理跨天的情况 (如设定23:55，当前00:05)
        if (diff_mins > 12 * 60) diff_mins -= 24 * 60;
        else if (diff_mins < -12 * 60) diff_mins += 24 * 60;
        
        // 只要查到有一顿药在 +/-10 分钟内
        if (diff_mins >= -10 && diff_mins <= 10) {
            is_time_to_eat = 1; // 把标志位置为1
            break; // 找到了就可以直接退出循环了，不用再查后面的药
        }
    }
    
    // 循环结束后，统一根据标志位去更新UI和发送语音指令
    if (is_time_to_eat) {
        g_ui_data.screen_3_update_step = true;  // 进入吃药确认界面
        tw_pkt.id = CMD_TX_TIME_TO_EAT; 
    } else {
        g_ui_data.screen_3_update_step = false; // 进入未到时间界面
        tw_pkt.id = CMD_TX_NOT_TIME_TO_EAT; 
    }
    
    // 统一发送一次队列消息
    xQueueSend(sendtianwenQueue, &tw_pkt, 0); 
}